In [1]:
import pandas as pd

# Задание 1

In [87]:
ratings = pd.read_csv('ratings.csv')
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [88]:
movies = pd.read_csv('movies.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [89]:
joined = ratings.merge(movies, on='movieId', how='left')
joined.head()

,userId,movieId,rating,timestamp,title,genres
0,1,1,4.0,964982703,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,1,3,4.0,964981247,Grumpier Old Men (1995),Comedy|Romance
2,1,6,4.0,964982224,Heat (1995),Action|Crime|Thriller
3,1,47,5.0,964983815,Seven (a.k.a. Se7en) (1995),Mystery|Thriller
4,1,50,5.0,964982931,"Usual Suspects, The (1995)",Crime|Mystery|Thriller

In [133]:
joined23=pd.pivot_table(
    joined[(joined['rating']==5)],
    index=['title'],
    values=['rating'],
    aggfunc=['count'],
    fill_value=0
).reset_index()
joined233 = joined23.reindex(joined23['count'].sort_values(by='rating', ascending=False).index)
joined233.head()

                                          title  count
                                                rating
2310           Shawshank Redemption, The (1994)    153
2092                        Pulp Fiction (1994)    123
956                         Forrest Gump (1994)    116
1660                         Matrix, The (1999)    109
2445  Star Wars: Episode IV - A New Hope (1977)    104

# Задание 2

In [54]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [64]:
filtered_countries = data[ (data['country']=='Lithuania') | (data['country']=='Latvia') | (data['country']=='Estonia') ]

           country  year  quantity  category
788289     Estonia  1996     323.0        42
788290     Estonia  1995     376.0        42
788291     Estonia  1994     183.0        42
788292     Estonia  1993     163.0        42
788293     Estonia  1992     378.0        42
...            ...   ...       ...       ...
1188862  Lithuania  2003       0.0        71
1188863  Lithuania  2002       0.0        71
1188864  Lithuania  2001       0.0        71
1188865  Lithuania  2000       0.0        71
1188866  Lithuania  1999       0.0        71

[10000 rows x 4 columns]

In [83]:
filtered_countries = data[ (data['country'] =='Lithuania') | (data['country']=='Latvia') | (data['country']=='Estonia')]
filtered_countries1 = filtered_countries[ (filtered_countries['category'] == 4) | (filtered_countries['category'] == 12) | (filtered_countries['category'] == 21)]
filtered_countries2 = filtered_countries1[ (filtered_countries1['year'] >= 2005) & (filtered_countries1['year'] <= 2010) & (filtered_countries1['quantity'] >= 0)]
filtered_countries2['quantity'].sum()

240580.0

# Задание 3

In [52]:
df = pd.read_html('https://www.finanz.ru/valyuty/eur', attrs = {'class': 'news_table'}, encoding='utf-8')
df[4:5]

[       Имя  Unnamed: 1     %    курс                 Дата
 0  EUR/RUB         NaN  3149  900045  19.12.2020 01:02:00
 1  USD/RUB         NaN  3996   73424  19.12.2020 01:00:00
 2  CHF/RUB         NaN   -26   83137  19.12.2020 15:29:00
 3  JPY/RUB         NaN    27    7107  19.12.2020 15:29:00
 4  GBP/RUB         NaN  -873  992694  19.12.2020 15:29:00
 5  NOK/RUB         NaN -2113   85509  19.12.2020 15:29:00
 6  AUD/RUB         NaN   268  559749  19.12.2020 15:29:00
 7  NZD/RUB         NaN   519  524331  19.12.2020 15:29:00
 8  TRY/RUB         NaN   -48   96245  19.12.2020 15:29:00]

In [53]:
df1 = pd.DataFrame(df)
type(df1)

pandas.core.frame.DataFrame